<?
$MESS["ACRIT_IMPORT_ELEMENTY_KOTORYH_NE"] = "Элементы, которых нет в файле:";
$MESS["ACRIT_IMPORT_NE_TROGATQ"] = "Не трогать";
$MESS["ACRIT_IMPORT_DEAKTIVIROVATQ"] = "Деактивировать";
$MESS["ACRIT_IMPORT_UDALITQ"] = "Удалить";
$MESS["ACRIT_IMPORT_NOVYE_ELEMENTY"] = "Новые элементы:";
$MESS["ACRIT_IMPORT_NOVYE_ELEMENTY_HINT"] = "Способ обработки элементов, которые есть в выгрузке, но не найдены в инфоблоке по 'Полю-идентификатору элемента'.<br>Варианты: сразу пометить галку \"Активность\", чтобы элемент отображался на сайте;<br>
создать элемент, но не активировать;<br>\"не создавать\" - этот пункт нужен, если вы хотите только обновлять базу сайта, не пополняя её новыми позициями.";
$MESS["ACRIT_IMPORT_SRAZU_AKTIVIROVATQ"] = "Сразу активировать";
$MESS["ACRIT_IMPORT_NE_AKTIVIROVATQ"] = "Не активировать";
$MESS["ACRIT_IMPORT_NE_SOZDAVATQ"] = "Не создавать";
$MESS["ACRIT_IMPORT_PARAMS_ITEMS_EXISTS"] = "Существующие элементы";
$MESS["ACRIT_IMPORT_PARAMS_ITEMS_EXISTS_HINT"] = "Способ обработки элементов, найденных в инфоблоке по 'Полю-идентификатору элемента'";
$MESS["ACRIT_IMPORT_PARAMS_ITEMS_EXISTS_UPDATE"] = "Обновлять";
$MESS["ACRIT_IMPORT_PARAMS_ITEMS_EXISTS_IGNORE"] = "Пропускать";
$MESS["ACRIT_IMPORT_DEAKTIVIROVATQ_TOVAR"] = "Деактивировать товары с нулевой ценой:";
$MESS["ACRIT_IMPORT_DEAKTIVIROVATQ_TOVAR_HINT"] = "Снимать галку \"Активность\" у элементов инфоблока при соответствующих условиях";
$MESS["ACRIT_IMPORT_DEAKTIVIROVATQ_TOVAR1"] = "Деактивировать товары с нулевым остатком:";
$MESS["ACRIT_IMPORT_DEAKTIVIROVATQ_TOVAR1_HINT"] = "Снимать галку \"Активность\" у элементов инфоблока при соответствующих условиях";
$MESS["ACRIT_IMPORT_PRIVAZYVATQ_K_RAZDEL"] = "Привязывать к разделам:";
$MESS["ACRIT_IMPORT_PRIVAZYVATQ_K_RAZDEL_HINT"] = "Опция позволяет определить, в каких случаях при импорте следует указывать привязку к разделу 
	(в соответствии с тем, как она задана на шаге \"Привязка полей\" или какой раздел указан в поле \"Раздел по-умолчанию для новых позиций\").<br> 
	По-умолчанию данные настройки привязки к разделам работают для всех импортируемых позиций. Но можно либо вообще отключить привязку к разделам, либо привязывать только новые позиции. 
	Можно настроить в каких случаях поле \"Разделы\" элементов инфоблока будет игнорироваться: если элемент уже привязан к какому-то разделу, то эта привязка остаётся, а если речь о создании элемента,
	то он не будет привязываться к какому-либо разделу.";
$MESS["ACRIT_IMPORT_VSE_ELEMENTY"] = "Все элементы";
$MESS["ACRIT_IMPORT_TOLQKO_NOVYE"] = "Только новые";
$MESS["ACRIT_IMPORT_NICEGO"] = "Ничего";
$MESS["ACRIT_IMPORT_SOZDAVATQ_NOVYE_RAZD"] = "Создавать новые категории:";
$MESS["ACRIT_IMPORT_SOZDAVATQ_NOVYE_RAZD_HINT"] = "отключить механизм создания новых категорий в инфоблоке. По-умолчанию, если для импортируемой позиции указана категория, но она отсутствует в инфоблоке, то она создаётся";
$MESS["ACRIT_IMPORT_PRIMENITQ_NASTROYKI"] = "Применить настройки инфоблока для обработки изображений";
$MESS["ACRIT_IMPORT_PRIMENITQ_NASTROYKI_HINT"] = "Речь о таких настройках, как создание картинки анонса из детальной, изменение размеров, наложение водного знака, сжатие изображений и проч. доступные при изменении инфоблока";
$MESS["ACRIT_IMPORT_DEFAULT_CATALOG_FIELD_TOVAR"] = "Заменить индивидуальные значения товаров значениями из настроек торгового каталога:";
$MESS["ACRIT_IMPORT_DEFAULT_CATALOG_FIELD_TOVAR_HINT"] = "Установить у товаров поля \"Уменьшать ли количество при заказе\" (QUANTITY_TRACE)<br>\"Возможность продажи товаров в минус\" (CAN_BUY_ZERO) из настроек торгового каталога";
$MESS["ACRIT_IMPORT_IMGS_SOURCE_TYPE_SERVER"] = "Каталог на текущем сервере или сторонний веб-сайт (http/https)";
$MESS["ACRIT_IMPORT_HELP_MAIN_PROPS"] = "Общие настройки профиля";
?>